[{"word":"pick up","phonetics":[],"meanings":[{"partOfSpeech":"verb","definitions":[{"definition":"To lift; to grasp and raise.","synonyms":[],"antonyms":["put down"],"example":"When you pick up the bag, make sure to support the bottom."},{"definition":"To collect an object, especially in passing.","synonyms":[],"antonyms":["drop off"],"example":"Can you pick up a pint of milk on your way home?"},{"definition":"To clean up; to return to an organized state.","synonyms":[],"antonyms":["mess up"],"example":"Aren't you going to pick up after yourself?"},{"definition":"To collect a passenger.","synonyms":[],"antonyms":["drop off"],"example":"I'll pick you up outside the library."},{"definition":"To collect and detain (a suspect).","synonyms":[],"antonyms":[],"example":"The cops have picked up the man they were looking for."},{"definition":"To obtain and publish a story, news item, etc.","synonyms":[],"antonyms":[],"example":"The story does not seem to have been widely picked up."},{"definition":"To improve, increase or speed up.","synonyms":[],"antonyms":[],"example":"Prices seem to be picking up again.  I was in bed sick this morning, but I'm picking up now."},{"definition":"To restart or resume.","synonyms":[],"antonyms":[],"example":"Let's pick up where we left off yesterday."},{"definition":"To learn, to grasp; to begin to understand; to realize.","synonyms":["learn"],"antonyms":[],"example":"It looks complicated, but you'll soon pick it up."},{"definition":"To receive (a radio signal or the like).","synonyms":[],"antonyms":[],"example":"With the new antenna, I can pick up stations all the way from Omaha."},{"definition":"To notice, detect or discern; to pick up on","synonyms":[],"antonyms":[],"example":"Did you pick up his nervousness?"},{"definition":"To point out (a person's behaviour, habits or actions) in a critical manner.","synonyms":[],"antonyms":[],"example":"She's always picking me up on my grammar."},{"definition":"To meet and seduce somebody for romantic purposes, especially in a social situation.","synonyms":["hit on"],"antonyms":[],"example":"He was in the fabric store not to buy fabric but to pick up women.  She could tell he intended to pick up on her.  Did you pick up at the party last night?"},{"definition":"To answer a telephone. See pick up the phone.","synonyms":[],"antonyms":[],"example":"I'm calling him, but he just isn't picking up!"},{"definition":"(of a phone) To receive calls; to function correctly.","synonyms":[],"antonyms":[],"example":"I've tried his home number a couple times, but it isn't picking up."},{"definition":"To pay for.","synonyms":[],"antonyms":[],"example":"The company will pick up lunch with customers for sales calls."},{"definition":"To reduce the despondency of.","synonyms":[],"antonyms":[]},{"definition":"To take control (physically) of something.","synonyms":[],"antonyms":[]},{"definition":"To mark, to defend against an opposition player by following them closely.","synonyms":[],"antonyms":[]},{"definition":"To record; to notch up.","synonyms":[],"antonyms":[]},{"definition":"To behave in a manner that results in a foul.","synonyms":[],"antonyms":[]}],"synonyms":["hit on","learn"],"antonyms":["drop off","drop off","mess up","put down"]},{"partOfSpeech":"noun","definitions":[{"definition":"An electronic device for detecting sound, vibration, etc., such as one fitted to an electric guitar or record player.","synonyms":[],"antonyms":[]},{"definition":"A pickup truck.","synonyms":[],"antonyms":[]},{"definition":"(usually attributive) Impromptu or ad hoc, especially of sports games and teams made up of randomly selected players.","synonyms":[],"antonyms":[],"example":"At lunch we had a game of pickup hockey."},{"definition":"An instance of approaching someone and engaging in romantic flirtation and courting with the intent to pursue romance, a date, or a sexual encounter. See also pick-up line, pick-up joint, pickup artist.","synonyms":[],"antonyms":[],"example":"Hey, thanks for the drink, but if this is a pickup, I'm not interested."},{"definition":"A person successfully approached in this manner for romance or sex.","synonyms":[],"antonyms":[]},{"definition":"In various games, the fielding or hitting of a ball just after it strikes the ground.","synonyms":[],"antonyms":[]},{"definition":"An item that can be picked up by the player, conferring some benefit or effect; a power-up.","synonyms":[],"antonyms":[]},{"definition":"The act of a challenging party or candidate winning an electoral district held by an incumbent party or candidate. See also gain","synonyms":[],"antonyms":[],"example":"The returns from the election show Apple Party candidate Jane Doe has made a pickup in the district of City West defeating Orange Party Incumbent Joe Smith"},{"definition":"The act of answering a telephone.","synonyms":[],"antonyms":[]},{"definition":"A relatively minor shot filmed or recorded after the fact to augment previous footage.","synonyms":[],"antonyms":[]},{"definition":"The act of collecting and taking away something or someone, usually in a vehicle.","synonyms":[],"antonyms":[]}],"synonyms":[],"antonyms":[]}],"license":{"name":"CC BY-SA 3.0","url":"https://creativecommons.org/licenses/by-sa/3.0"},"sourceUrls":["https://en.wiktionary.org/wiki/pick%20up","https://en.wiktionary.org/wiki/pickup"]}]